In [13]:
import pandas as pd
import numpy as np

url = "amazon.csv"

Data = pd.read_csv(url, encoding = "ISO-8859-1")

print(Data)

      year      state     month  number        date
0     1998       Acre   Janeiro     0.0  1998-01-01
1     1999       Acre   Janeiro     0.0  1999-01-01
2     2000       Acre   Janeiro     0.0  2000-01-01
3     2001       Acre   Janeiro     0.0  2001-01-01
4     2002       Acre   Janeiro     0.0  2002-01-01
...    ...        ...       ...     ...         ...
6449  2012  Tocantins  Dezembro   128.0  2012-01-01
6450  2013  Tocantins  Dezembro    85.0  2013-01-01
6451  2014  Tocantins  Dezembro   223.0  2014-01-01
6452  2015  Tocantins  Dezembro   373.0  2015-01-01
6453  2016  Tocantins  Dezembro   119.0  2016-01-01

[6454 rows x 5 columns]

# test

In [15]:
Data1 = pd.DataFrame(np.random.rand(8,4))
print(Data1)

          0         1         2         3
0  0.371767  0.855874  0.422147  0.142318
1  0.213638  0.331528  0.513642  0.343875
2  0.726574  0.932577  0.986524  0.940164
3  0.526856  0.084819  0.418076  0.595247
4  0.090038  0.153414  0.408622  0.004140
5  0.647901  0.853753  0.304097  0.714597
6  0.994634  0.984450  0.180987  0.207823
7  0.832758  0.126546  0.653156  0.595278

In [16]:
Data.head(12)

    year state    month  number        date
0   1998  Acre  Janeiro     0.0  1998-01-01
1   1999  Acre  Janeiro     0.0  1999-01-01
2   2000  Acre  Janeiro     0.0  2000-01-01
3   2001  Acre  Janeiro     0.0  2001-01-01
4   2002  Acre  Janeiro     0.0  2002-01-01
5   2003  Acre  Janeiro    10.0  2003-01-01
6   2004  Acre  Janeiro     0.0  2004-01-01
7   2005  Acre  Janeiro    12.0  2005-01-01
8   2006  Acre  Janeiro     4.0  2006-01-01
9   2007  Acre  Janeiro     0.0  2007-01-01
10  2008  Acre  Janeiro     0.0  2008-01-01
11  2009  Acre  Janeiro     0.0  2009-01-01

### show the last rows

In [17]:
Data.tail(5)

      year      state     month  number        date
6449  2012  Tocantins  Dezembro   128.0  2012-01-01
6450  2013  Tocantins  Dezembro    85.0  2013-01-01
6451  2014  Tocantins  Dezembro   223.0  2014-01-01
6452  2015  Tocantins  Dezembro   373.0  2015-01-01
6453  2016  Tocantins  Dezembro   119.0  2016-01-01

### Tama√±o de la data filas, columnas

In [18]:
Data.shape

(6454, 5)

### Caracteristicas de la data

In [21]:
Data.info

<bound method DataFrame.info of       year      state     month  number        date
0     1998       Acre   Janeiro     0.0  1998-01-01
1     1999       Acre   Janeiro     0.0  1999-01-01
2     2000       Acre   Janeiro     0.0  2000-01-01
3     2001       Acre   Janeiro     0.0  2001-01-01
4     2002       Acre   Janeiro     0.0  2002-01-01
...    ...        ...       ...     ...         ...
6449  2012  Tocantins  Dezembro   128.0  2012-01-01
6450  2013  Tocantins  Dezembro    85.0  2013-01-01
6451  2014  Tocantins  Dezembro   223.0  2014-01-01
6452  2015  Tocantins  Dezembro   373.0  2015-01-01
6453  2016  Tocantins  Dezembro   119.0  2016-01-01

[6454 rows x 5 columns]>